app/views/devise/registrations/edit.html.erb

      %>
      <div class="input-field d-flex flex-row"><%= f.select :user_cohort, options_for_select(@select_cohort)%> </div>
---
SELECT "cohorts".* FROM "cohorts"