app/views/makeups/index.html.erb

        <hr class="separator m-0 ml-2"></hr>
          <% for j in 1..Cohort.all.size do %>
---
SELECT COUNT(*) FROM "cohorts"