app/controllers/makeups_controller.rb

  def create
    @user = current_user
    @makeup = @user.makeups.new(makeup_params)

    respond_to do |format|
      if @makeup.save
---
INSERT INTO "makeups" ("created_at", "updated_at", "clicked_cohort", "clicked_day", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", 2017-03-31 22:37:46 UTC], ["updated_at", 2017-03-31 22:37:46 UTC], ["clicked_cohort", "SF - PM - 4/4/2017 - Tuesday - 34th - B"], ["clicked_day", "W1A"], ["user_id", 1]]